CNJerryZheng/Preparation-for-NUEDC/control/STM32F407_Template/svd/Cortex-M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ID</name>
      <description>ID registers</description>
      <baseAddress>0xE000ED00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CPUID</name>
          <displayName>CPUID</displayName>
          <description>CPUID</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>Implementer</name>
              <description>Implementer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>Variant</name>
              <description>Variant</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Constant</name>
              <description>Constant</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Partno</name>
              <description>Partno</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>Revision</name>
              <description>Revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR0</name>
          <displayName>ID_PFR0</displayName>
          <description>ID_PFR0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>State1</name>
              <description>State1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Thumb_Thumb2</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR1</name>
          <displayName>ID_PFR1</displayName>
          <description>ID_PFR1</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>M_Profile</name>
              <description>M_Profile</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Two_stack</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_DFR0</name>
          <displayName>ID_DFR0</displayName>
          <description>ID_DFR0</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>M_Profile</name>
              <description>M_Profile</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_AFR0</name>
          <displayName>ID_AFR0</displayName>
          <description>ID_AFR0</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
        </register>
        <register>
          <name>ID_MMFR0</name>
          <displayName>ID_MMFR0</displayName>
          <description>ID_MMFR0</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>Auxiliary_registers</name>
              <description>Auxiliary_registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Shareability_levels</name>
              <description>Shareability_levels</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>One_level</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Outermost_shareability</name>
              <description>Outermost_shareability</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Non_cacheable</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ignored</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMSA</name>
              <description>PMSA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMSAv7</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR1</name>
          <displayName>ID_MMFR1</displayName>
          <description>ID_MMFR1</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
        </register>
        <register>
          <name>ID_MMFR2</name>
          <displayName>ID_MMFR2</displayName>
          <description>ID_MMFR2</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WFI</name>
              <description>WFI</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR3</name>
          <displayName>ID_MMFR3</displayName>
          <description>ID_MMFR3</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
        </register>
        <register>
          <name>ID_ISAR0</name>
          <displayName>ID_ISAR0</displayName>
          <description>ID_ISAR0</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>Divide_instrs</name>
              <description>Divide_instrs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Debug_instrs</name>
              <description>Debug_instrs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Coproc_instrs</name>
              <description>Coproc_instrs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>None</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generic</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generic2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCRR_MRRC</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCRR2_MRRC2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CmpBranch_instrs</name>
              <description>CmpBranch_instrs</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Bitfield_instrs</name>
              <description>Bitfield_instrs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BitCount_instrs</name>
              <description>BitCount_instrs</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR1</name>
          <displayName>ID_ISAR1</displayName>
          <description>ID_ISAR1</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>Interwork_instrs</name>
              <description>Interwork_instrs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>None</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BX</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BX_BLX2</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Immediate_instrs</name>
              <description>Immediate_instrs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IfThen_instrs</name>
              <description>IfThen_instrs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Extend_instrs</name>
              <description>Extend_instrs</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR2</name>
          <displayName>ID_ISAR2</displayName>
          <description>ID_ISAR2</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>Reversal_instrs</name>
              <description>Reversal_instrs</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MultU_instrs</name>
              <description>MultU_instrs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MultS_instrs</name>
              <description>MultS_instrs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Mult_instrs</name>
              <description>Mult_instrs</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MultiAccessInt_instrs</name>
              <description>MultiAccessInt_instrs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MultiAccessInt_instrs</name>
              <description>MultiAccessInt_instrs</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>LoadStore_instrs</name>
              <description>LoadStore_instrs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR3</name>
          <displayName>ID_ISAR3</displayName>
          <description>ID_ISAR3</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TrueNOP_instrs</name>
              <description>TrueNOP_instrs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ThumbCopy_instrs</name>
              <description>ThumbCopy_instrs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TabBranch_instrs</name>
              <description>TabBranch_instrs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SynchPrim_instrs</name>
              <description>SynchPrim_instrs</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SVC_instrs</name>
              <description>SVC_instrs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIMD_instrs</name>
              <description>SIMD_instrs</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Saturate_instrs</name>
              <description>Saturate_instrs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR4</name>
          <displayName>ID_ISAR4</displayName>
          <description>ID_ISAR4</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PSR_M_instrs</name>
              <description>PSR_M_instrs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SynchPrim_instrs_frac</name>
              <description>SynchPrim_instrs_frac</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Barrier_instrs</name>
              <description>Barrier_instrs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_supported</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Writeback_instrs</name>
              <description>Writeback_instrs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Basic</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WithShifts_instrs</name>
              <description>WithShifts_instrs</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>Unpriv_instrs</name>
              <description>Unpriv_instrs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
